<!--
 * @Description: 
 * @Author: ZhangChuan
 * @Date: 2020-04-13 11:48:15
 * @LastEditors: ZhangChuan
 * @LastEditTime: 2020-04-29 17:31:28
 -->
<template>
  <div class="handle-rent-agreement">
    <div class="content">
      <h2 class="title">根据《中华人民共和国合同法》及相关法律法规的规定，甲乙双方在平等、自愿、协商一致的基础上，就甲方向乙方租用保管箱的相关事宜，达成如下协议。</h2>
      <h2 class="title">第一条 甲方向乙方租用保管箱，用于存放金银珠宝饰物、贵重艺术品及文献、货币、票据及有价证券、契约与重要文件及其他贵重物品，该保管箱由乙方为甲方保管。</h2>
      <p>甲方租用乙方的保管箱，箱型为： 型，其规格尺寸为（长×宽×高）：A型：440×240×60；B型：440×240×80；C型：440×240×130；D型：440×240×180；E型：440×240×330；F型：440×240×430；G型：440×240×580；H型：990×240×330，租期为 年（月），自 年 月 日至 年 月 日止。</p>
      <h2
        class="title"
      >第二条 甲方应于申请租用保管箱之日向乙方一次性全额支付租金 元人民币，保证金 元人民币。保证金不计付利息，且本协议项下甲方产生的欠费，乙方可从保证金中进行扣除。</h2>
      <h2
        class="title"
      >第三条 甲方不得利用保管箱作非法用途。甲方不得利用保管箱存放易燃、易爆、易腐蚀、易挥发、放射性等危险品；不得存放液态、易碎物品；不得存放枪支、弹药、雷管、毒品以及其他一切违禁物品；不得利用保管箱进行窝藏赃物等违法犯罪活动。由此造成乙方或第三方损失（包括但不限于人身损害或财产损失）及其他法律责任的由甲方负责，对甲方涉及的违法行为，乙方可向有权机关举报。</h2>
      <h2 class="title">第四条 甲方不得将保管箱转让或转租他人。否则，乙方有权解除本协议，有权要求甲方办理退租手续，且保证金和租金均不退还。并有权追究甲方相关法律责任。</h2>
      <h2
        class="title"
      >第五条 甲方一旦租用保管箱，乙方将严格按照国家法律法规的有关规定，保护甲方的合法权益，并保守其秘密。除法律规定外，乙方可拒绝任何单位或个人对甲方租用的保管箱进行查询、查封、冻结和扣押。对国家有权机关依法查询、查封、冻结或扣押保管箱内财物的，乙方应依法予以配合，对由此产生的一切后果不承担责任。如甲方租用的保管箱被查封、冻结和扣押的，须在查封、冻结或扣押依法解除后方可使用。</h2>
      <h2
        class="title"
      >第六条 乙方只对保管箱的安全性、完整性负责，不对存入保管箱内的物品的质量和数量负责。保管箱内所存物品因自然变质、损坏或不可抗力（包括但不限于乙方不能预见、不能避免并不能克服的战争、暴动、风灾、火灾、水灾、台风、地震、政府行为等客观情况）导致的后果，乙方不承担任何责任。若甲方租用的保管箱箱体上的锁具和锁具上面的卡封片完整，以及卡封片上面的数字条码和甲方在卡封片上的亲笔签名与预留的信息无误的，乙方对甲方就箱内物品提出的任何异议不承担责任。</h2>
      <h2 class="title">第七条 保管箱日常开启的约定</h2>
      <p>（一）甲方或甲方被授权人可在营业时间内，提供租用保管箱时登记的所有证明文件、保管箱钥匙、保管箱业务密码或指纹信息办理保管箱开启手续。</p>
      <p>（二）当甲方或甲方被授权人不能提供租用保管箱时登记的有效身份证件时，可提交临时身份证等乙方认可的有效证明文件。</p>
      <p>（三）乙方因检查、维修或其他特殊情况，要求甲方开启保管箱的，乙方应提前通知甲方，甲方应开箱配合。</p>
      <p>（四）当乙方因改造或迁移等原因拆迁保管箱保管库，乙方应提前通知甲方，甲方应配合乙方办理迁移或保管箱退租手续。</p>
      <h2 class="title">第八条 有下列情形之一的，乙方有权拒绝开箱：</h2>
      <p>（一）申请开箱人未能提供乙方认可的身份证件或身份认证资料（印章、签字、密码、指纹等）或申请开箱人提供的身份证件或身份认证资料与预留资料不符。</p>
      <p>（二）未按约定缴纳租金、保证金、手续费及滞纳金等。</p>
      <p>（三）保管箱钥匙或密码处于挂失状态。</p>
      <p>（四）保管箱已被国家有权机关依法查封、冻结、扣押。</p>
      <p>（五）其他依法应当拒绝开箱的情形。</p>
      <h2 class="title">第九条 设立、变更被授权人的约定</h2>
      <p>（一）甲方授权委托他人办理保管箱业务的，被授权人须持授权文件到现场办理，授权委托书须明确指定授权人员、授权期限和授权事项等内容。</p>
      <p>（二）租约期内甲方不允许取消或变更授权委托，如需取消或变更授权委托的，应先退租再重新办理租用手续。</p>
      <h2 class="title">第十条 保管箱挂失约定</h2>
      <p>甲方密码遗忘或保管箱挂锁钥匙遗失后可到乙方指定受理点办理正式挂失，或通过乙方呼叫中心服务热线0830-96830办理口头挂失。口头挂失有效期从挂失之日起计算为五天，过期自动解挂。挂失期间，保管箱作冻结处理，甲方不得开箱存取物品。</p>
      <p>甲方可在营业时间内到保管箱存放点办理密码重置和更换钥匙。</p>
      <p>因更换钥匙需要进行凿箱处理的，在凿箱过程中对保管箱内存放的物品造成不可避免的损坏，乙方不承担任何责任。</p>
      <p>由于遗失保管箱密码或钥匙出现的经济、法律及其它责任，由甲方承担。</p>
      <h2 class="title">第十一条 保管箱退租、续租的约定</h2>
      <p>（一）甲方可随时向乙方提出退租申请。</p>
      <p>（二）保管箱中途退租的处理：</p>
      <p>1.甲方在中途要求退租的，应持租用时所提供的证明文件。</p>
      <p>2.甲方退租，应缴清全部费用，并经乙方经办人员审核无误后办理退租手续。</p>
      <p>3.中途退租的，租金不作退还。</p>
      <p>（三）保管箱续租的处理：保管箱租用期满前，乙方将通过短信或电话通知甲方，甲方应在租用逾期前办理续租手续。</p>
      <p>（四）保管箱租用期满退租的处理：保管箱租用期届满后一个月内办理退箱手续的，乙方收取一个月租金；超过一个月但不足两个月的，乙方收取两个月租金；以后如此类推。</p>
      <p>（五）保管箱租用期满后未办理退租、续租或出现特殊情况的处理：</p>（五）保管箱租用期满后未办理退租、续租或出现特殊情况的处理：
      <p>1.甲方在保管箱租用期满后若未能按时交付租金，要求乙方开箱的，乙方有权拒绝，直至甲方缴清所欠费用为止。</p>
      <p>2.甲方租用期满后未办理退租手续又未续交租金的，乙方将从逾期日开始按月从保证金中扣除租金（期间乙方将采用电话、短信等甲方预留的联系方式通知甲方），直至甲方保证金全部扣除后仍未办理退租手续又未续交租金的，乙方有权采用公证方式进行凿箱处理，对箱内物品登记造册移存妥善保管，由此产生的一切费用和责任由甲方承担。</p>2.甲方租用期满后未办理退租手续又未续交租金的，乙方将从逾期日开始按月从保证金中扣除租金（期间乙方将采用电话、短信等甲方预留的联系方式通知甲方），直至甲方保证金全部扣除后仍未办理退租手续又未续交租金的，乙方有权采用公证方式进行凿箱处理，对箱内物品登记造册移存妥善保管，由此产生的一切费用和责任由甲方承担。
      <p>3.凿箱后超过6个月甲方仍未办理有关手续的，乙方有权将移存的物品依法自行处理，用以偿还租金、公证费、开箱费及移存保管等一切有关费用，剩余部分退还乙方，不足部分，乙方享有继续追缴的权利。</p>
      <p>4.如甲方出现死亡或失踪等特殊情况时，开箱人需提供乙方认可的相应法定证明文件、经公证机关公证的合法继承等手续，由此产生的费用由开箱人承担。</p>
      <p>5.凿箱产生的相关费用以保管箱开箱地点公示的收费标准为准。</p>
      <p>（六）甲方在退箱时无违约情况的，乙方向甲方退还保证金。但甲方有下列情形之一的，乙方有权扣除或不退还保证金：</p>
      <p>1.甲方退箱时拒绝缴清应付费用；</p>
      <p>2.甲方在保管箱租用期满后仍未办理退箱或续租手续的；</p>
      <p>3.甲方凿箱、换内锁挂锁、工时费、公证费等费用未缴纳的；</p>
      <p>4.甲方违反其它约定，给乙方造成不利影响的。</p>
      <h2 class="title">第十二条 保管箱租用费用收取约定</h2>
      <p>（一）保管箱保证金和租金调整：乙方可根据市场情况调整收费标准，但在原租期内仍按原标准执行不作调整，原租期结束后按调整后的价格标准执行。</p>
      <p>（二）保管箱其他费用：保管箱其他费用是指除租金、保证金之外，包括但不限于滞纳金、更换保管箱挂锁的费用以及其它实际产生的手续费、工本费、工时费等。保管箱其他费用按保管箱存放地点公示的收费标准收取。</p>
      <p>（三）如甲方出现合并、分立、变更、歇业等情况时，乙方接到甲方主体变更的合法证明和退租申请后，经审核无误，按约定收取相关费用后，办理退租手续。</p>
      <h2
        class="title"
      >第十三条 本协议未尽事宜依据中华人民共和国法律、法规及金融业的行业惯例办理。本协议在履行期间发生的任何争议双方均可协商解决，协商不成的，可向乙方所在地的人民法院提起诉讼。</h2>
      <h2 class="title">第十四条 《泸州市商业银行保管箱存取操作规程》系本协议附件，与本协议具有同等的法律效力。甲方应认真、仔细阅读。</h2>
      <h2 class="title">第十五条 甲方存入的物品为易碎品（包括但不限于玉器、瓷器等），应在存入前向乙方书面申明，并由甲、乙双方另作约定。</h2>
      <h2
        class="title"
      >第十六条 甲方应在保管箱租用事务办理室对存取保管箱箱体的全过程通过监控系统进行监督，如对上述过程有异议应立即提出，并双方进行查证和确认，否则，视为甲方无异议处理。</h2>
      <h2 class="title">第十七条 本协议经甲乙双方签字、盖章后生效。</h2>
      <h2 class="title">第十八条 本协议一式两份，甲乙双方各执一份，具有同等法律效力。</h2>
    </div>
    <div class="footer button-on">
      <div class="btns" @click="nextStep">返回</div>
    </div>
  </div>
</template>

<script>
import { newOpenRouterByValue } from "../../../handler/handler";
export default {
  data() {
    return {};
  },
  components: {},
  methods: {
    nextStep() {
      newOpenRouterByValue.call(this,"handleRentConfirm");
    }
  }
};
</script>

<style lang="less" scoped>
@import "~components/style/common.less";
@import "~components/style/filex.less";
.handle-rent-agreement {
  background: @color-white;
  padding: 0.3rem;
  text-align: justify;
  .content {
    padding-bottom: 100px;
  }
  h1 {
    text-align: left;
    font-weight: bold;
    font-size: 0.36rem;
    height: 1rem;
    line-height: 1rem;
  }
  p {
    text-indent: 2em;
        margin-bottom: .1rem;
  }
  .bolder {
    font-weight: bold;
  }
  .title {
    font-weight: bold;
    text-indent: 2em;
    margin: .2rem 0;
  }
  .footer{
  .safeBox-footer()
}
}
</style>