<template>
    <div class="protocol">
        <h1>泸州银行快捷支付及银行卡绑卡服务协议</h1>
        <h2 class="title">第一条 概述</h2>
        <p>1.此快捷支付及银行卡绑卡服务协议（以下简称“本协议”）是泸州银行股份有限公司（以下简称“我行”）与我行持卡用户（以下简称“用户”或“您”)就快捷支付服务（以下简称“本服务”）所订立的有效合约。请您仔细阅读本协议<span class="bolder">（ 特别是字体加粗部分）</span>。如您对本协议内容及页面提示信息有疑问，请勿进行下一步操作，您可通过我行的客服电话95830进行咨询，以便我们为您解释和说明。<span class="bolder">如您通过网络页面点击确认或以我们认可的其他方式选择接受本协议的，即表示您与我行已达成本协议并同意接受本协议的全部约定内容。</span></p>
        <p>2.<span class="bolder">如本协议发生变更，我们将通过网站等公告的方式提前予以公布，协议修改文本生效日期以公告载明日期为准。若您不同意变更修改后的协议内容，您有权停止使用相关服务；双方协商一致的，也可另行变更相关服务和对应协议内容。</span></p>
        <h2 class="title">第二条 双方权利义务</h2>
        <p>1.您应确保您是使用本服务的银行卡持有人，可合法、有效使用该银行卡且未侵犯任何第三方合法权益，否则，因此造成我行、持卡人损失的，您应负责赔偿并承担法律责任。</p>
        <p>2.<span class="bolder">您应确保开通本服务所提供的所有个人有效信息均为本人所有，为此，您理解并同意我行通过第三方渠道对您所提供手机号码的真实性、有效性、证件号码等进行核实。</span></p>
        <p>3.<span class="bolder">您同意将开通本服务的银行卡与您此次登录的系统登录账户进行绑定，以便于您今后进行支付。同时基于防范风险及保障您资金安全等需求，您理解我行可能对前述绑卡行为进行限制。</span></p>
        <p>4.<span class="bolder">您同意我行有权依据其自身判断对涉嫌欺诈或被他人控制并用于欺诈目的的我行账户采取相应的措施，例如：对您的我行账户中的余额进行止付、终止或中止为您提供我行服务、处置涉嫌欺诈的资金等。</span></p>
        <p>5.<span class="bolder">您应妥善保管我行银行卡、卡号、密码、我行柜面预留的手机号码以及数字证书、支付盾、手机动态口令、手机验证码、账户绑定的手机号码、来自于我行向您发送的校验码等与银行卡或与我行账户有关的一切信息和设备。如您遗失或泄露前述信息和/或设备的，您应及时通知我行，以减少可能发生的损失。无论是否已通知我行，因您的原因所致损失需由您自行承担。</span></p>
        <p>6.您在使用本服务时，应当认真确认交易信息，包括且不限于商品名称、数量、金额等，并按我行业务流程发出符合我行服务协议约定的指令。<span class="bolder">您认可和同意：您发出的指令不可撤回或撤销，我行一旦根据您的指令从银行卡中划扣资金给收款人，您不应以非本人意愿交易或其他原因要求我行退款或承担其他责任。</span></p>
        <p>7.您在对使用本服务过程中发出指令的真实性及有效性负责；我行依照您的指令进行操作的风险须由您承担。</p>
        <p>8.您认可我行对账户的使用记录数据、交易金额数据等均以我行系统平台记录的数据为准。</p>
        <p>9.我行重视对个人信息处理与保护，将遵循合法、正当、必要的原则，依照法律法规与我行的规定，严格保护您的信息。</p>
        <p>（1）您应保证使用本服务过程中提供的信息真实、准确、完整、有效；我行将按照您设置的相关信息为您提供相应服务，若您设置的信息有误，您需要自行承担相应的后果与损失；</p>
        <p class="bolder">（2）为了防范风险，保障您的资金安全， 您理解并同意我行使用您设置的信息，如：姓名、身份证件号码、银行卡信息（含银行卡卡号、有效期）及预留手机号，并进行相关验证。同时，为了及时、准确地完成付款，并满足反洗钱等监管要求，您理解并同意我行需要记录您使用支付服务的交易信息；同时，您可以根据页面提示，通过我行查询您的银行卡余额和您在我行开立的所有账户的其他相关信息等。</p>
        <p>（3）在您使用本服务期间及本服务终止后，您理解并同意我行在相关法律法规或监管要求的期限内保留您在使用本服务过程中提供或新产生的相关信息。</p>
        <p>10.<span class="bolder">出现下列情况之一的，我行有权立即终止您使用我行相关服务而免于承担任何责任：</span></p>
        <p class="bolder">（1）将本服务用于非法目的；</p>
        <p class="bolder">（2）违反本协议的约定；</p>
        <p class="bolder">（3）违反我行网站的条款、协议、规则、通告等相关规定及您与前述主体签署的任一协议，而被上述主体终止提供服务的；</p>
        <p class="bolder">（4）我行认为向您提供本服务存在风险的；</p>
        <p class="bolder">（5）您的银行卡无效、有效期届满或注销（如有）。</p>
        <p>11.<span class="bolder">若您未违反本协议约定且因不能归责于您的原因，造成银行卡内资金通过本服务出现损失，且您未从中获益的，您可向我行申请补偿。您应在知悉资金发生损失后及时通知我行并按要求提交相关的申请材料和证明文件，我行将及时处理您的申请。具体处理方式由我行自行选择决定，我行承诺不会因此损害您的合法权益。</span></p>
        <p>12.<span class="bolder">不论我行选择何种方式保障您使用本服务的资金安全，您同意并认可我行最终的补偿行为或保险赔偿行为并不代表前述资金损失应归责于我行，亦不代表我行须为此承担其他责任。您同意，我行在向您支付补偿的同时，即刻取得您可能或确实存在的就前述资金损失而产生的对第三方的所有债权及其他权利，包括但不限于就上述债权向第三方追偿的权利，且您不再就上述已经让渡给我行的债权向该第三方主张任何权利，亦不再就资金损失向我行主张权利。</span></p>
        <p>13.<span class="bolder">若您又从其它渠道挽回了资金损失的，或有新证据证明您涉嫌欺诈的，或者发生您应当自行承担责任的其他情形，您应在第一时间通知我行并返还我行已补偿已赔偿的款项，否则我行有权通过司法等途径向您进行追偿。 </span></p>
        <h2 class="title">第三条 其他条款</h2>
        <p>1.本协议的成立、生效、履行和解释，均适用中华人民共和国法律（仅为本协议之目的，为避免疑义，不包括香港特别行政区、澳门特别行政区及台湾地区法律）。各方在履行本协议的过程中，如发生争议，应协商解决。协商不成的，任何一方均可向被告住所地有管辖权的人民法院提起诉讼。</p>
    </div>
</template>
<script>
import {backRouterByValue} from '../../handler/handler'
import { registerHandler, notifyAppBackEvent } from 'sslib/common/SnJsBridge'
import { throttle, initTitleMenu } from 'sslib/common/extend'
export default {
    data(){
        return{

        }
    },
    created(){
        let _this = this;
        initTitleMenu(["银行卡使用协议"]);
        notifyAppBackEvent(); //调用app，通知返回事件
        registerHandler('notifyAppBack', function (data) {//点击app返回事件
            throttle(function () {
                if(!!_this.$route.query.addData||!!_this.$route.query.unbindData){
                    _this.$route.query.backFlag = 1;
                    backRouterByValue('verifycode',_this.$route.query,_this); 
                }else if(!!_this.$route.query.name||!!_this.$route.query.cardData){
                    backRouterByValue('cardadd',_this.$route.query,_this); 
                }                  
            }.bind(this));
        });
    }
}
</script>
<style lang="less" scoped>
    @import '~components/style/common.less';
    .protocol{
        background: @color-white;
        padding: .3rem;
        text-align: justify;
    }
    h1{
        text-align: center;
        font-weight: bold;
        font-size: .36rem;
        height: 1rem;
        line-height: 1rem;
    }
    p{
        text-indent:2em
    }
    .bolder{
        font-weight:bold;
    }
    .title{
        font-weight:bold;
        text-indent:2em;
    }
</style>
